from pyrogram.types import InlineKeyboardButton


class Keshav:
   
    #Alpha Buttons
    alpha_buttons = [
         [InlineKeyboardButton("✨About Update💫", callback_data="cmda")],
         [InlineKeyboardButton("✨Credits💫", callback_data="credits")]
    ]
    
    home_button = [
        [InlineKeyboardButton("✨Back🕊", callback_data="home")]
    ]


    # aboutupdate
    CMDA = """
** ᴜɴᴏғғɪᴄɪᴀʟ ᴇxᴛᴇɴsɪᴏɴ ʙʏ ᴀʟᴘʜᴀ**

$_> ᴘʀᴇsᴇɴᴛ ᴠᴇʀsɪᴏɴ ᴏғ ʟɪғᴇ ɢᴀᴍᴇs ɪs ʙᴏʀᴇᴅ ᴀғ , sᴏ ɢᴏɪɴɢ ᴛᴏ ᴀᴅᴅ ғᴇᴡ ᴍᴏʀᴇ ᴄᴏᴍᴍᴀɴᴅs ᴛᴏ ᴀᴅᴅ ᴍᴜᴄʜ ғᴜɴ !!\n\n$_> ʏᴏᴜ'ʟʟ ɢᴇᴛ ᴛᴏ sᴇᴇ ᴛʜɪs ᴜᴘᴅᴀᴛᴇ sᴏᴏɴ ! , ᴀᴘᴘʀᴏx = 𝟷𝟹ᴛʜ ᴊᴜɴᴇ 𝟸𝟶𝟸𝟷\n\n$_> ᴘᴇʀsᴏɴᴀʟ ᴀɴᴅ ᴜɴᴏғғɪᴄɪᴀʟ ᴘʀᴏᴊᴇᴄᴛ ʙʏ [ᴀʟᴘʜᴀ](t.me/NotReallyAlpha)\n\n$_> ɴᴏ ᴄᴏᴘʏʀɪɢʜᴛ ᴡɪʟʟ ʙᴇ ᴘʀᴇsᴇɴᴛ ! ᴄᴏᴢ ᴛʜɪs ɪs ɢᴏɪɴɢ ᴛᴏ ᴍᴀᴅᴇ ᴜɴᴅᴇʀ ᴘᴇʀsᴏɴᴀʟ ʀᴇᴘᴏsɪᴛᴏʀʏ ᴏғ ᴀʟᴘʜᴀ !\n\n$_> ɪғ ʏᴏᴜ ʜᴀᴠɪɴɢ ᴄᴏᴏʟ ᴛʜᴏᴜɢʜᴛs ᴀʙᴏᴜᴛ ᴛʜɪs : ғᴏʀᴡᴀʀᴅ ᴛʜᴏsᴇ ᴛᴏ [ʜɪᴍ](t.me/NotReallyAlpha) ! ©\n\n$_> ᴛʜᴀɴᴋ ʏᴏᴜ ғᴏʀ ᴠɪsɪᴛɪɴɢ ! ʜᴀᴠᴇ ᴀ ɢᴏᴏᴅ ᴅᴀʏ .

"""

    # credits
    CREDITS = """
** ᴄʀᴇᴅɪᴛs **

••> ᴀʟɢᴏʀɪᴛʜᴍ ғᴏʀ ʙᴇᴛᴛɪɴɢ - [ʜᴇxᴀ](t.me/Monocapped_Octahedron_xd)\n\n••> ɪɴ ʟᴀᴡ ʀᴇʟᴀᴛᴇᴅ ᴄᴏᴍᴍᴀɴᴅs - [sʜᴇʀʀʏ](t.me/Creamy_02)\n\n••> ᴏᴡɴᴇʀ - [ɴᴀʏᴀɴᴛᴀʀᴀ](t.me/NotReallyNeon)\n\n••> ᴄᴏᴅᴇ ʙʏ - [•](t.me/NotReallyAlpha)

"""

   
